In [1349]:
print(True==False)
print(True!=0)
print(False==0)
print(True or False)
print(1=='1')

False
True
True
True
False

In [1317]:
eng='kkk'
big_eng=eng.upper()
big_eng

'KKK'

In [1350]:
eng='korea COVID 19'
print(eng.lower())
print(eng.upper())

korea covid 19
KOREA COVID 19

In [1351]:
data=[]
data.append('기지디')
data.append(1)
dat

['기지디', 1]

In [1352]:
data=[]
data.append('jave')
data[0],data[-1],data[1:],data[:2]
print(data.sort())
print(data.reverse())

None
None

In [1353]:
ban={'가지사','자사바'}
num={1,2,3}
ban|num

{1, 2, 3, '가지사', '자사바'}

In [1385]:
b=(1,2,3,'사','러')
c=1,2,3
type(b),type(c)
#b[3]=4
b[3:],b[1:4]

(('사', '러'), (2, 3, '사'))

In [1405]:
dic={'name1':'경민','학번1':20103,'name1':'경민2','학번2':20104}
dic.get('neme1')
print(dic.keys())
print(dic.values())

dict_keys(['name1', '학번1', '학번2'])
dict_values(['경민2', 20103, 20104])

In [1668]:
lunch={'햄','치','라','콜',10000}
dinner={'햄','치','라','콜',10000}

In [1412]:
import pandas as pd

In [1414]:
li=[1,2,3]
li

[1, 2, 3]

In [1416]:
type(li)

list

# s1=pd.core.series.-Series(li)
s1

In [1427]:
s2=pd.core.series.Series(['일','이','삼'])
s2

0    일
1    이
2    삼
dtype: object

In [1428]:
data=dict(num=s1,word=s2)
data

{'num': 0    1
 1    2
 2    3
 dtype: int64, 'word': 0    일
 1    이
 2    삼
 dtype: object}

In [1431]:
pd.DataFrame(data)

   num word
0    1    일
1    2    이
2    3    삼

In [1579]:
data=pd.DataFrame([['a',100],['b',200],['c',300]])
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
0    3 non-null object
1    3 non-null int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

In [1605]:
data.head

<bound method NDFrame.head of    0    1
0  a  100
1  b  200
2  c  300>

In [1607]:
data.tail(1)

   0    1
2  c  300

In [1608]:
data.tail(2)

   0    1
1  b  200
2  c  300

In [1609]:
col=['1군','2군']

In [1627]:
pd.DataFrame([['a',100],['b',200],['c',300]],columns=col)

  1군   2군
0  a  100
1  b  200
2  c  300

In [1663]:
man=[{'Name':'은주','A':20,'j':'j1'},
     {'Name':'가주','A':30,'j':'j2'},
     {'Name':'지주','A':40,'j':'j3'},
    ]
pd.DataFrame(man,index=[1,2,3])

  Name   A   j
1   은주  20  j1
2   가주  30  j2
3   지주  40  j3

In [3216]:
a=[1,2,3]
b=[4,5,6]
df=[a,b]
dd=df=pd.DataFrame(df,index=[1,2],columns=['A','B','C'])
dd

   A  B  C
1  1  2  3
2  4  5  6